viikko5/app/controllers/breweries_controller.rb

INSERT INTO "breweries" ("active", "created_at", "name", "updated_at", "year") VALUES (?, ?, ?, ?, ?)  [["active", false], ["created_at", Mon, 24 Feb 2014 16:52:09 UTC +00:00], ["name", "Ninamo"], ["updated_at", Mon, 24 Feb 2014 16:52:09 UTC +00:00], ["year", 1678]]
---
  def create
     ["brewerylist-name", "brewerylist-year"].each{ |f| expire_fragment(f) }
    @brewery = Brewery.new(brewery_params)

    respond_to do |format|
      if @brewery.save

SELECT "breweries".* FROM "breweries" WHERE "breweries"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "breweries" SET "active" = ?, "updated_at" = ? WHERE "breweries"."id" = 1  [["active", false], ["updated_at", Mon, 24 Feb 2014 16:56:52 UTC +00:00]]
---
def toggle_activity
    brewery = Brewery.find(params[:id])
    brewery.update_attribute :active, (not brewery.active)

UPDATE "breweries" SET "name" = ?, "updated_at" = ? WHERE "breweries"."id" = 4  [["name", "BrewDog"], ["updated_at", Thu, 16 Jan 2014 19:41:59 UTC +00:00]]
---
  def update
   expire_fragment('brewerylist')

    respond_to do |format|
      if @brewery.update(brewery_params)

DELETE FROM "breweries" WHERE "breweries"."id" = ?  [["id", 5]]
---
  def destroy
   expire_fragment('brewerylist')
    @brewery.destroy